# ### Умовні конструкції:
# 1. **Перевірка паролю:**
#    Завдання: Напишіть програму, яка встановлює початковий пароль і перевіряє, чи введений користувачем пароль співпадає з ним.
#    Якщо пароль дорівнює "password123", виведіть повідомлення "Ви увійшли в систему". В іншому випадку виведіть повідомлення "Неправильний пароль".

# password = 'assword123'
#
# if password == 'password123':
#         print('Ви увійшли в систему')
# else:
#         print('Неправильний пароль')

# 2. **Визначення днів тижня:**
#    Завдання: Створіть програму, яка встановлює номер дня тижня і виводить назву відповідного дня тижня. Якщо номер дня недійсний (менше 1 або більше 7), виведіть повідомлення про помилку.

# week_days = 5
#
# if week_days >= 1 and week_days <= 7:
#         if week_days == 1:
#                 print('Понеділок')
#         elif week_days == 2:
#                 print('Вівторок')
#         elif week_days == 3:
#                 print('Середа')
#         elif week_days == 4:
#                 print('Четвер')
#         elif week_days == 5:
#                 print("П'ятниця")
#         elif week_days == 6:
#                 print('Cубота')
#         elif week_days == 7:
#                 print('Неділя')
#         else:
#                 print('Помилка, номер має бути від 1 до 7')

# ### Цикли:
# 1. **Таблиця множення:**
#    Завдання: Виведіть таблицю множення для заданого числа від 1 до 10.

# num = 4
#
# a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
#
# print(f'Таблиця множення для {num}:')
#
# for x in a:
#         print(f'{x}*{num}= {x*num}')
#
# 2. **Сума чисел:**
#    Завдання: Визначте список чисел і обчисліть їх суму.

# summ_list = [3, 4342, 2, 212, 1, 3]
#
# a = 0
#
# for x in summ_list:
#         a += x
# print(f' Список чисел: {summ_list}')
#
# print(f' Сума: {a}')

# 3. **Факторіал числа:**
#    Завдання: Обчисліть факторіал заданого числа.
# num = 9
#
# a = 1
#
# for x in range(1, num+1):
#         a *= x
# print(f' Факторіал: {num} = {a}')

# 4. **Парні числа:**
#    Завдання: Виведіть всі парні числа від 1 до 50.

print('Парні числа від 1 до 50:')
for x in range(1, 51):
        if x%2 == 0:
         print(x)

# 5. **Пошук простих чисел:**
#    Завдання: Знайдіть всі прості числа в заданому діапазоні.
# Створіть власні змінні або встановіть початкові значення, щоб виконати ці завдання без використання `input`. Використовуйте умовні конструкції і цикли для розв'язання кожного завдання. Бажаю успіхів у виконанні цих завдань!
